# Используем официальный образ Go как "сборщик"
FROM golang:1.24.6-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для кэширования зависимостей
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь исходный код проекта
COPY . .

# Собираем статичный бинарник, который не будет зависеть от системных библиотек
# CGO_ENABLED=0 - это ключ к успеху для маленьких образов
RUN CGO_ENABLED=0 go build -o /app/ssh-fetcher .

# --- Этап 2: Финальный образ ---
# Используем минималистичный образ. Alpine - отличный выбор.
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /app
RUN mkdir logs

# Копируем ТОЛЬКО скомпилированный бинарник из этапа сборки
COPY --from=builder /app/ssh-fetcher .

# Копируем папку с конфигурацией по умолчанию
COPY devices/ ./devices/

# Указываем, какая команда будет выполняться при запуске контейнера
# Мы используем массив, чтобы избежать проблем с обработкой аргументов шеллом
ENTRYPOINT ["./ssh-fetcher"]